In [1]:
import pandas as pd 
import numpy as np

In [5]:
#  dummy dictionary to convert it into dataframe

data = {
    'first_name': ['Alice', 'Bob', 'Charlie', 'David'],
    'last_name': ['Pretty', 'Chura', 'BC', 'BSDK'],
    'age': [25, 32, 18, 47],
    'city': ['New York', 'Paris', 'London', 'San Francisco'],
    'salary':[10000,120000,125000,105000]
}

In [6]:
data = pd.DataFrame(data)

In [7]:
df = pd.read_csv("CSVs\survey_results_public.csv")

## Adding new column in dataframe

In [9]:
data["name"] + data["city"]

0         AliceNew York
1              BobParis
2         CharlieLondon
3    DavidSan Francisco
dtype: object

In [18]:
data["name_city"] = data["name"] + " " + data["city"]

In [19]:
data

# Now our original dataset is modified
# We can also make a new column on the analysis of other columns with the help pf apply()

      name  age           city  salary            name_city
0    Alice   25       New York   10000       Alice New York
1      Bob   32          Paris  120000            Bob Paris
2  Charlie   18         London  125000       Charlie London
3    David   47  San Francisco  105000  David San Francisco

## Deleting column in dataframe

In [20]:
data.drop(columns="name_city", inplace = True)

# "name_city" column has been dropped in results but not in original dataset if we dont use inplace argument
# setting inplace = true because otherwise it will affect the dataset
data

      name  age           city  salary
0    Alice   25       New York   10000
1      Bob   32          Paris  120000
2  Charlie   18         London  125000
3    David   47  San Francisco  105000